"Western (Mac OS Roman)" = "ภาษาตะวันตก (Mac OS Roman)";
"Japanese (Mac OS)" = "ญี่ปุ่น (Mac OS)";
"Traditional Chinese (Mac OS)" = "จีนโบราณ (Mac OS)";
"Korean (Mac OS)" = "เกาหลี (Mac OS)";
"Arabic (Mac OS)" = "อารบิก (Mac OS)";
"Hebrew (Mac OS)" = "ฮีบรู (Mac OS)";
"Greek (Mac OS)" = "กรีก (Mac OS)";
"Cyrillic (Mac OS)" = "ซีริลลิก (Mac OS)";
"Devanagari (Mac OS)" = "เทวนาครี (Mac OS)";
"Gurmukhi (Mac OS)" = "คุรมุขี (Mac OS)";
"Gujarati (Mac OS)" = "คุชราตี (Mac OS)";
"Thai (Mac OS)" = "ไทย (Mac OS)";
"Simplified Chinese (Mac OS)" = "จีนตัวย่อ (Mac OS)";
"Tibetan (Mac OS)" = "ทิเบต (Mac OS)";
"Central European (Mac OS)" = "ยุโรปกลาง (Mac OS)";
"Symbol (Mac OS)" = "สัญลักษณ์ (Mac OS)";
"Dingbats (Mac OS)" = "ภาษาสัญลักษณ์ (Mac OS)";
"Turkish (Mac OS)" = "ตุรกี (Mac OS)";
"Croatian (Mac OS)" = "โครเอเชียน (Mac OS)";
"Icelandic (Mac OS)" = "ไอซ์แลนด์ (Mac OS)";
"Romanian (Mac OS)" = "โรมาเนียน (Mac OS)";
"Celtic (Mac OS)" = "เซลติค (Mac OS)";
"Gaelic (Mac OS)" = "เกลอิค (Mac OS)";
"Keyboard Symbols (Mac OS)" = "สัญลักษณ์คีย์บอร์ด (Mac OS)";
"Farsi (Mac OS)" = "ฟาร์ซี (Mac OS)";
"Cyrillic (Mac OS Ukrainian)" = "ซีริลลิก (Mac OS Ukraninian)";
"Inuit (Mac OS)" = "อินุ (Mac OS)";
"Unicode (UTF-16)" = "Unicode (UTF-16)";
"Unicode (UTF-7)" = "Unicode (UTF-7)";
"Unicode (UTF-8)" = "Unicode (UTF-8)";
"Unicode (UTF-32)" = "Unicode (UTF-32)";
"Unicode (UTF-16BE)" = "Unicode (UTF-16BE)";
"Unicode (UTF-16LE)" = "Unicode (UTF-16LE)";
"Unicode (UTF-32BE)" = "Unicode (UTF-32BE)";
"Unicode (UTF-32LE)" = "Unicode (UTF-32LE)";
"Western (ISO Latin 1)" = "ภาษาตะวันตก (ISO Latin 1)";
"Central European (ISO Latin 2)" = "ยุโรปกลาง (ISO Latin 2)";
"Western (ISO Latin 3)" = "ภาษาตะวันตก (ISO Latin 3)";
"Central European (ISO Latin 4)" = "ยุโรปกลาง (ISO Latin 4)";
"Cyrillic (ISO 8859-5)" = "ซีริลลิก (ISO 8859-5)";
"Arabic (ISO 8859-6)" = "อารบิก (ISO 8859-6)";
"Greek (ISO 8859-7)" = "กรีก (ISO 8859-7)";
"Hebrew (ISO 8859-8)" = "ฮีบรู (ISO 8859-8)";
"Turkish (ISO Latin 5)" = "ตุรกี (ISO Latin 5)";
"Nordic (ISO Latin 6)" = "นอร์ดิก (ISO Latin 6)";
"Thai (ISO 8859-11)" = "ไทย (ISO 8859-11)";
"Baltic (ISO Latin 7)" = "บอลติก (ISO Latin 7)";
"Celtic (ISO Latin 8)" = "เซลติค (ISO Latin 8)";
"Western (ISO Latin 9)" = "ภาษาตะวันตก (ISO Latin 9)";
"Romanian (ISO Latin 10)" = "โรมาเนียน (ISO Latin 10)";
"Latin-US (DOS)" = "ละตินอเมริกัน (DOS)";
"Greek (DOS)" = "กรีก (DOS)";
"Baltic (DOS)" = "บอลติก (DOS)";
"Western (DOS Latin 1)" = "ภาษาตะวันตก (DOS Latin 1)";
"Greek (DOS Greek 1)" = "กรีก (DOS Greek 1)";
"Central European (DOS Latin 2)" = "ยุโรปกลาง (DOS Latin 2)";
"Cyrillic (DOS)" = "ซีริลลิก (DOS)";
"Turkish (DOS)" = "ตุรกี (DOS)";
"Portuguese (DOS)" = "โปรตุเกส (DOS)";
"Icelandic (DOS)" = "ไอซ์แลนด์ (DOS)";
"Hebrew (DOS)" = "ฮีบรู (DOS)";
"Canadian French (DOS)" = "ฝรั่งเศสแบบแคนาดา (DOS)";
"Arabic (DOS)" = "อารบิก (DOS)";
"Nordic (DOS)" = "นอร์ดิก (DOS)";
"Russian (DOS)" = "รัสเซียน (DOS)";
"Greek (DOS Greek 2)" = "กรีก (DOS Greek 2)";
"Thai (Windows, DOS)" = "ไทย (Windows, DOS)";
"Japanese (Windows, DOS)" = "ญี่ปุ่น (Windows, DOS)";
"Simplified Chinese (Windows, DOS)" = "จีนตัวย่อ (Windows, DOS)";
"Korean (Windows, DOS)" = "เกาหลี (Windows, DOS)";
"Traditional Chinese (Windows, DOS)" = "จีนโบราณ (Windows, DOS)";
"Western (Windows Latin 1)" = "ภาษาตะวันตก (Windows Latin 1)";
"Central European (Windows Latin 2)" = "ยุโรปกลาง (Windows Latin 2)";
"Cyrillic (Windows)" = "ซีริลลิก (Windows)";
"Greek (Windows)" = "กรีก (Windows)";
"Turkish (Windows Latin 5)" = "ตุรกี (Windows Latin 5)";
"Hebrew (Windows)" = "ฮีบรู (Windows)";
"Arabic (Windows)" = "อารบิก (Windows)";
"Baltic (Windows)" = "บอลติก (Windows)";
"Vietnamese (Windows)" = "เวียดนาม (Windows)";
"Western (ASCII)" = "ภาษาตะวันตก (ASCII)";
"Japanese (Shift JIS X0213)" = "ญี่ปุ่น (Shift JIS X0213)";
"Chinese (GBK)" = "จีน (GBK)";
"Chinese (GB 18030)" = "จีน (GB 18030)";
"Japanese (ISO 2022-JP)" = "ญี่ปุ่น (ISO 2022-JP)";
"Japanese (ISO 2022-JP-2)" = "ญี่ปุ่น (ISO 2022-JP-2)";
"Japanese (ISO 2022-JP-1)" = "ญี่ปุ่น (ISO 2022-JP-1)";
"Chinese (ISO 2022-CN)" = "จีน (ISO 2022-CN)";
"Korean (ISO 2022-KR)" = "เกาหลี (ISO 2022-KR)";
"Japanese (EUC)" = "ญี่ปุ่น (EUC)";
"Simplified Chinese (GB 2312)" = "จีนตัวย่อ (GB 2312)";
"Traditional Chinese (EUC)" = "จีนโบราณ (EUC)";
"Korean (EUC)" = "เกาหลี (EUC)";
"Japanese (Shift JIS)" = "ญี่ปุ่น (Shift JIS)";
"Cyrillic (KOI8-R)" = "ซีริลลิก (KOI8-R)";
"Traditional Chinese (Big 5)" = "จีนโบราณ (Big 5)";
"Western (Mac Mail)" = "ภาษาตะวันตก (Mac Mail)";
"Simplified Chinese (HZ GB 2312)" = "จีนตัวย่อ (HZ GB 2312)";
"Traditional Chinese (Big 5 HKSCS)" = "จีนโบราณ (Big 5 HKSCS)";
"Ukrainian (KOI8-U)" = "ยูเครนเนียน (KOI8-U)";
"Traditional Chinese (Big 5-E)" = "จีนโบราณ (Big 5-E)";
"Western (NextStep)" = "ภาษาตะวันตก (NextStep)";
"Non-lossy ASCII" = "Non-lossy ASCII";
"Western (EBCDIC Latin Core)" = "ภาษาตะวันตก (EBCDIC Latin Core)";
"Western (EBCDIC Latin 1)" = "ภาษาตะวันตก (EBCDIC Latin 1)";
"Japanese (Auto Detect)" = "ญี่ปุ่น (Auto  Detect)";
